In [310]:
import numpy as np
import pandas as pd

In [311]:
indexes = ['Iran','b','c']
list_py = [10,20,30]
dic = {'a':10 , 'b':20 , 'c':30}

In [312]:
sample = pd.Series(list_py,indexes)

In [313]:
sample

Iran    10
b       20
c       30
dtype: int64

In [314]:
covid19_data = pd.Series(data = [2000,400,1220,587,54789], index = ['Iran' , 'Usa' , 'India' , 'China' , 'France'])

In [315]:
covid19_data * 2

Iran        4000
Usa          800
India       2440
China       1174
France    109578
dtype: int64

In [316]:
covid19_data + sample

China        NaN
France       NaN
India        NaN
Iran      2010.0
Usa          NaN
b            NaN
c            NaN
dtype: float64

In [317]:
columns = ['Q','W','E','R','T']

In [318]:
index = ['A','B','C','D']

In [319]:
data = np.random.randint(-100 , 100 ,  (4,5))

In [320]:
data

array([[ 95,  51,  51,  46,  89],
       [-22,   8,  52, -34, -33],
       [ 48,  98,  98,   5,  -9],
       [ 83,  14,  14, -23,   7]])

In [321]:
df = pd.DataFrame(data,index,columns)

In [322]:
df

    Q   W   E   R   T
A  95  51  51  46  89
B -22   8  52 -34 -33
C  48  98  98   5  -9
D  83  14  14 -23   7

In [323]:
type(df)

pandas.core.frame.DataFrame

In [324]:
df['W']

A    51
B     8
C    98
D    14
Name: W, dtype: int32

In [325]:
type(df['Q'])

pandas.core.series.Series

In [326]:
df['new columns'] = df['Q'] + df["W"]

In [327]:
df

    Q   W   E   R   T  new columns
A  95  51  51  46  89          146
B -22   8  52 -34 -33          -14
C  48  98  98   5  -9          146
D  83  14  14 -23   7           97

In [328]:
df.drop('Q', axis = 1)

    W   E   R   T  new columns
A  51  51  46  89          146
B   8  52 -34 -33          -14
C  98  98   5  -9          146
D  14  14 -23   7           97

In [329]:
df

    Q   W   E   R   T  new columns
A  95  51  51  46  89          146
B -22   8  52 -34 -33          -14
C  48  98  98   5  -9          146
D  83  14  14 -23   7           97

In [330]:
df = df.drop('Q',axis=1)

In [331]:
df

    W   E   R   T  new columns
A  51  51  46  89          146
B   8  52 -34 -33          -14
C  98  98   5  -9          146
D  14  14 -23   7           97

In [332]:
df.loc['A']

W               51
E               51
R               46
T               89
new columns    146
Name: A, dtype: int32

In [333]:
type(df.loc[['A','B']])

pandas.core.frame.DataFrame

In [334]:
df.loc[["A","B"]]

    W   E   R   T  new columns
A  51  51  46  89          146
B   8  52 -34 -33          -14

In [335]:
df_new = df.drop('A')

In [336]:
df_new

    W   E   R   T  new columns
B   8  52 -34 -33          -14
C  98  98   5  -9          146
D  14  14 -23   7           97

In [337]:
df.iloc[0:2,2:]

    R   T  new columns
A  46  89          146
B -34 -33          -14

In [338]:
df.loc[['A','B'],['W','new columns']]

    W  new columns
A  51          146
B   8          -14

In [339]:
df.iloc[-1:,-1:]

   new columns
D           97

In [340]:
df.iloc[-1:]

    W   E   R  T  new columns
D  14  14 -23  7           97

In [341]:
df

    W   E   R   T  new columns
A  51  51  46  89          146
B   8  52 -34 -33          -14
C  98  98   5  -9          146
D  14  14 -23   7           97

In [342]:
df >= 0

      W     E      R      T  new columns
A  True  True   True   True         True
B  True  True  False  False        False
C  True  True   True  False         True
D  True  True  False   True         True

In [343]:
df[df >= 0]

    W   E     R     T  new columns
A  51  51  46.0  89.0        146.0
B   8  52   NaN   NaN          NaN
C  98  98   5.0   NaN        146.0
D  14  14   NaN   7.0         97.0

In [344]:
df[df['W'] > 0].iloc[:1]

    W   E   R   T  new columns
A  51  51  46  89          146

In [345]:
df.columns

Index(['W', 'E', 'R', 'T', 'new columns'], dtype='object')

In [346]:
df[(df['W'] > 1) & (df['new columns'] >= 0)]

    W   E   R   T  new columns
A  51  51  46  89          146
C  98  98   5  -9          146
D  14  14 -23   7           97

In [347]:
df.reset_index()

  index   W   E   R   T  new columns
0     A  51  51  46  89          146
1     B   8  52 -34 -33          -14
2     C  98  98   5  -9          146
3     D  14  14 -23   7           97

In [348]:
index_states = ['Bastam', 'Shahrood', 'Bonab', 'Tabriz']

In [349]:
df['States'] = index_states

In [350]:
df = df.set_index('States')

In [351]:
df

           W   E   R   T  new columns
States
Bastam    51  51  46  89          146
Shahrood   8  52 -34 -33          -14
Bonab     98  98   5  -9          146
Tabriz    14  14 -23   7           97

In [352]:
df.describe()

               W          E          R          T  new columns
count   4.000000   4.000000   4.000000   4.000000     4.000000
mean   42.750000  53.750000  -1.500000  13.500000    93.750000
std    41.451779  34.393556  35.669782  52.949662    75.455837
min     8.000000  14.000000 -34.000000 -33.000000   -14.000000
25%    12.500000  41.750000 -25.750000 -15.000000    69.250000
50%    32.500000  51.500000  -9.000000  -1.000000   121.500000
75%    62.750000  63.500000  15.250000  27.500000   146.000000
max    98.000000  98.000000  46.000000  89.000000   146.000000

In [353]:
df.dtypes

W              int32
E              int32
R              int32
T              int32
new columns    int32
dtype: object

In [354]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Bastam to Tabriz
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   W            4 non-null      int32
 1   E            4 non-null      int32
 2   R            4 non-null      int32
 3   T            4 non-null      int32
 4   new columns  4 non-null      int32
dtypes: int32(5)
memory usage: 112.0+ bytes

In [355]:
df

           W   E   R   T  new columns
States
Bastam    51  51  46  89          146
Shahrood   8  52 -34 -33          -14
Bonab     98  98   5  -9          146
Tabriz    14  14 -23   7           97

In [356]:
df['E'][2] = np.nan
df['E'][3] = np.nan
df['W'][0] = np.nan
df['W'][1] = np.nan
df['W'][2] = np.nan

C:\Users\Yasin\AppData\Local\Temp\ipykernel_4332\1910374095.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['W'][0] = np.nan

In [357]:
df

             W     E   R   T  new columns
States
Bastam     NaN  51.0  46  89          146
Shahrood   NaN  52.0 -34 -33          -14
Bonab      NaN   NaN   5  -9          146
Tabriz    14.0   NaN -23   7           97

In [358]:
# axis = 1 means delete column 
# thresh means at least valid data in any coulmn need to not delete
df.dropna(axis=1, thresh = 2)

             E   R   T  new columns
States
Bastam    51.0  46  89          146
Shahrood  52.0 -34 -33          -14
Bonab      NaN   5  -9          146
Tabriz     NaN -23   7           97

In [359]:
df.fillna(value = 'unavailable')

                    W            E   R   T  new columns
States
Bastam    unavailable         51.0  46  89          146
Shahrood  unavailable         52.0 -34 -33          -14
Bonab     unavailable  unavailable   5  -9          146
Tabriz           14.0  unavailable -23   7           97

In [360]:
df['E'] = df['E'].fillna(value=df['E'].mean())

In [361]:
df

             W     E   R   T  new columns
States
Bastam     NaN  51.0  46  89          146
Shahrood   NaN  52.0 -34 -33          -14
Bonab      NaN  51.5   5  -9          146
Tabriz    14.0  51.5 -23   7           97

In [362]:
df['W'] = df['W'].fillna(value = 0 )

In [364]:
df

             W     E   R   T  new columns
States
Bastam     0.0  51.0  46  89          146
Shahrood   0.0  52.0 -34 -33          -14
Bonab      0.0  51.5   5  -9          146
Tabriz    14.0  51.5 -23   7           97

In [366]:
df_csv = pd.read_csv('/py practice/Exercise Notebooks/Data/Universities.csv')

In [371]:
df_csv.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [381]:
df_csv.groupby('Year').sum().sort_index(ascending=False)

,Sector,University,Completions,Geography
Year,,,,
2016,"Private for-profit, 2-yearPrivate for-profit, ...",Pima Medical Institute-Las VegasHealthcare Pre...,26224,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2015,"Private for-profit, 2-yearPrivate not-for-prof...",Pima Medical Institute-Las VegasRoseman Univer...,26279,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2014,"Private not-for-profit, 4-year or abovePrivate...",Roseman University of Health SciencesExpertise...,24730,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2013,"Private for-profit, 2-yearPrivate for-profit, ...",Aviation Institute of Maintenance-Las VegasDeV...,21046,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2012,"Private for-profit, less-than 2-yearPrivate fo...",Academy of Hair Design-Las VegasCareer College...,20333,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...

In [394]:
df_csv.groupby(['Year','University']).sum().sort_index(ascending=False).transpose()

Year                                            2016                           \
University     Wongu University of Oriental Medicine   Western Nevada College
Sector       Private not-for-profit, 4-year or above  Public, 4-year or above
Completions                                        0                      960
Geography                                     Nevada                   Nevada

Year                                               \
University  Utah College of Massage Therapy-Vegas
Sector       Private for-profit, less-than 2-year
Completions                                   240
Geography                                  Nevada

Year                                                                        \
University          University of Phoenix-Nevada University of Nevada-Reno
Sector       Private for-profit, 4-year or above   Public, 4-year or above
Completions                                  423                      4309
Geography                                 Nevada                    Nevada

Year                                                                          \
University  University of Nevada-Las Vegas Truckee Meadows Community College
Sector             Public, 4-year or above                    Public, 2-year
Completions                           5367                              2431
Geography                           Nevada                            Nevada

Year                                                  \
University                   Touro University Nevada
Sector       Private not-for-profit, 4-year or above
Completions                                      356
Geography                                     Nevada

Year                                              \
University        The Art Institute of Las Vegas
Sector       Private for-profit, 4-year or above
Completions                                  135
Geography                                 Nevada

Year                                                  ...  \
University                     Sierra Nevada College  ...
Sector       Private not-for-profit, 4-year or above  ...
Completions                                      261  ...
Geography                                     Nevada  ...

Year                                                          2012  \
University  Euphoria Institute of Beauty Arts & Sciences-Summerlin
Sector                              Private for-profit, 2-year
Completions                                                113
Geography                                               Nevada

Year                                                                   \
University  Euphoria Institute of Beauty Arts & Sciences-Green Valley
Sector                              Private for-profit, 2-year
Completions                                                153
Geography                                               Nevada

Year                                                                \
University  College of Southern Nevada   Casal Institute of Nevada
Sector         Public, 4-year or above  Private for-profit, 2-year
Completions                       2348                          87
Geography                       Nevada                      Nevada

Year                                                                  \
University      Carrington College-Reno Carrington College-Las Vegas
Sector       Private for-profit, 2-year   Private for-profit, 2-year
Completions                         145                          120
Geography                        Nevada                       Nevada

Year                                                                        \
University  Career College of Northern Nevada Brightwood College-Las Vegas
Sector             Private for-profit, 2-year   Private for-profit, 2-year
Completions                               333                          568
Geography                              Nevada                       Nevada

Year                                               \
University            Advanced Training Institute
Sector       Private for-profit, less-than 2-year
Completions                                   218
Geography                                  Nevada

Year
University       Academy of Hair Design-Las Vegas
Sector       Private for-profit, less-than 2-year
Completions                                   110
Geography                                  Nevada

[3 rows x 207 columns]

In [386]:
df_csv.groupby(['University','Year']).describe().transpose()

University        Academy of Hair Design-Las Vegas                             \
Year                                          2012  2013   2014   2015   2016
Completions count                              1.0   1.0    1.0    1.0    1.0
            mean                             110.0  84.0  256.0  180.0  124.0
            std                                NaN   NaN    NaN    NaN    NaN
            min                              110.0  84.0  256.0  180.0  124.0
            25%                              110.0  84.0  256.0  180.0  124.0
            50%                              110.0  84.0  256.0  180.0  124.0
            75%                              110.0  84.0  256.0  180.0  124.0
            max                              110.0  84.0  256.0  180.0  124.0

University        Advanced Training Institute                              \
Year                                     2012   2013   2014   2015   2016
Completions count                         1.0    1.0    1.0    1.0    1.0
            mean                        218.0  157.0  147.0  266.0  372.0
            std                           NaN    NaN    NaN    NaN    NaN
            min                         218.0  157.0  147.0  266.0  372.0
            25%                         218.0  157.0  147.0  266.0  372.0
            50%                         218.0  157.0  147.0  266.0  372.0
            75%                         218.0  157.0  147.0  266.0  372.0
            max                         218.0  157.0  147.0  266.0  372.0

University         ... Utah College of Massage Therapy-Vegas                \
Year               ...                                  2013   2014   2015
Completions count  ...                                   1.0    1.0    1.0
            mean   ...                                 372.0  290.0  316.0
            std    ...                                   NaN    NaN    NaN
            min    ...                                 372.0  290.0  316.0
            25%    ...                                 372.0  290.0  316.0
            50%    ...                                 372.0  290.0  316.0
            75%    ...                                 372.0  290.0  316.0
            max    ...                                 372.0  290.0  316.0

University               Western Nevada College                              \
Year                2016                   2012   2013   2014   2015   2016
Completions count    1.0                    1.0    1.0    1.0    1.0    1.0
            mean   240.0                  495.0  522.0  842.0  925.0  960.0
            std      NaN                    NaN    NaN    NaN    NaN    NaN
            min    240.0                  495.0  522.0  842.0  925.0  960.0
            25%    240.0                  495.0  522.0  842.0  925.0  960.0
            50%    240.0                  495.0  522.0  842.0  925.0  960.0
            75%    240.0                  495.0  522.0  842.0  925.0  960.0
            max    240.0                  495.0  522.0  842.0  925.0  960.0

University        Wongu University of Oriental Medicine
Year                                               2016
Completions count                                   1.0
            mean                                    0.0
            std                                     NaN
            min                                     0.0
            25%                                     0.0
            50%                                     0.0
            75%                                     0.0
            max                                     0.0

[8 rows x 207 columns]